[
    {
        "Name": "I'm Vivek Rajput",
        "Role": "Designer & Developer",
        "Description": "Crafting seamless experiences and bold visuals. College student by day, creative thinker, and aspiring innovator by night."
    },
    {
        "AboutPara1": "I’m Vivek Rajput, a curious designer, coder, and a problem solver. Currently a student at Jabalpur Engineering College, but always exploring the limitless possibilities of creativity and technology.",
        "AboutPara2": "I thrive on transforming problems into solutions, ideas into reality, whether it's crafting digital interfaces, designing immersive visuals, or building websites that feel effortless to use."
    },
    [
        {
            "project_img": "/src/assets/JlugSummerSS2.webp",
            "project_name": "JEC Linux Users Group Summer School Website",
            "project_description": "Developed a web platform as part of a team that enables users to register for workshops, access detailed information about them, and submit feedback or reviews. "
        },
        {
            "project_img": "/src/assets/KrishiMitraSS.webp",
            "project_name": "Krishi Mitra",
            "project_description": "Collaborated in developing an AI-powered Smart Crop Advisory Platform that offers real-time farming insights, image-based crop analysis, and weather or market alerts. Integrated multilingual chatbot and voice support to assist small and marginal farmers with accessible, data-driven guidance."
        },
        {
            "project_img": "/src/assets/NoteBlocSS.webp",
            "project_name": "NoteBloc Landing Page",
            "project_description": "Its a Landing Page with minimalistitc designa and animations providing the users all the necesaary information about the product"
        }
    ],
    [
        {
            "time_period": "2024 - Present",
            "role": "Lead Designer at"
        },
        {
            "time_period": "2024 - 2022",
            "role": "Senior UI/UX Designer at"
        },
        {
            "time_period": "2022 - 2020",
            "role": "Product Designer at"
        }
    ],
    {
        "para": "I’m always interested in exploring new opportunities, or exchanging ideas with like-minded individuals. Feel free to contact me if you'd like to connect or to discuss a potential project"
    },
    {
        "copyright_message": "Copyright © 2025 TheVivekRajput002. All rights reserved."
    }
]